// !! Task # 1 (Форматировщик даты)
// Создайте страницу, которая спросит у пользователя день, месяц и год, и выведет на страницу дату в красивом формате.
// Используйте шаблонную строку.
// ! RESULT
// document.body.innerHTML = `<h1 style="color: purple;">Your date is ${prompt(
//   "What is the day?"
// )} <strong style='color:violet;'>${prompt(
//   "What is the month?"
// )}</strong> ${prompt("What is the year?")} </h1>`;

// !! Task # 2 (Перевод температуры)
// Попросите пользователя ввести температуру в градусах Цельсия.
// Переведите в Фаренгейты: F = C * 1.8 + 32
// и наоборот: С = (5 * (F - 32)) / 9
// Выведите результат на страницу.
// !RESULT

// !! Task # 3 (Округления)
// Пусть есть число 3.67892
// Выведите:
//   - округление вниз
//   - вверх
//   - обычное
//   - до двух знаков после запятой
// !RESULT

// !! Task # 4 (Генератор случайного числа)
// Выведите случайное число от 1 до 100.
// Подсказка:
// Math.floor(Math.random() * 100) + 1
// !RESULT

// !! Task # 5 (Проверка на число)
// Пользователь вводит что-то через prompt.
// Определите:
//   - можно ли перевести в число
//   - является ли результат NaN
//   - Выведите соответствующее сообщение.
// !RESULT

// !! Task # 6 (Работа со строками)
// Пусть у вас есть строка:
// const str = "JavaScript is awesome";
// Выполните:
//     - выведите длину строки
//     - выведите слово "JavaScript" из строки
//     - замените "awesome" на "cool"
//     - сделайте всю строку в верхнем регистре
// !RESULT

// !! Task # 7 (Создание логина)
// Пользователь вводит:
//  - имя
//  - фамилию
//  - Сформируйте логин формата:
//     <имя>.<фамилия>@gmail.com
// Используйте:
//  - trim
//  - toLowerCase
//  - шаблонные строки
// !RESULT

// !! Task # 8 (Расчёт цены с НДС по заданной цене и количеству)
// Напишите программу, которая:
//     - С помощью prompt() спросит пользователя цену за 1 штуку без НДС.
//     - Затем спросит количество штук.
//     - Рассчитает:
//             - общую цену без НДС
//             - сумму НДС (21 %)
//             - общую цену с НДС
//     - Выведет результат с помощью alert().
// !RESULT
